{
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "dirt",
    "1": "grass",
    "10": "log",
    "11": "person",
    "12": "fence",
    "13": "bush",
    "14": "concrete",
    "15": "barrier",
    "16": "puddle",
    "17": "mud",
    "18": "rubble",
    "19": "sign",
    "2": "tree",
    "20": "rock",
    "3": "pole",
    "4": "water",
    "5": "sky",
    "6": "vehicle",
    "7": "object",
    "8": "asphalt",
    "9": "building"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "asphalt": 8,
    "barrier": 15,
    "building": 9,
    "bush": 13,
    "concrete": 14,
    "dirt": 0,
    "fence": 12,
    "grass": 1,
    "log": 10,
    "mud": 17,
    "object": 7,
    "person": 11,
    "pole": 3,
    "puddle": 16,
    "rock": 20,
    "rubble": 18,
    "sign": 19,
    "sky": 5,
    "tree": 2,
    "vehicle": 6,
    "water": 4
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "transformers_version": "5.1.0",
  "use_cache": false
}
